# encoding: utf-8

require 'tokenizer'

tokenizer = Tokenizer::WhitespaceTokenizer.new
p tokenizer.tokenize DATA.read



__END__
www.bizdin.kg

ББК 63. 3 (2 Ки) К 97
Бул китеп «Кыргыз Республикасында гуманитардык билим берүүнү өзгөртүү»
программасынын талаптарына ылайык «Кыргызстан — Сорос» фонду тарабынан
чыгарылууда.
Программанын спонсору белгилүү америкалык финансист жана философ
Жорж Сорос.
Түзгөн Кеңеш ЖУСУПОВ

К 97 «Кыргыздар». Буга чейин «Кыргыздардын» эки тому өзүнчө китеп болуп
1991—1993-жылдары көп нуска менен жарык көргөн. Ал китептерге байыркы
замандан тартып бүгүнкү күнгө чейинки кыргыздардын санжырасы, тарыхы,
маданий мурасы жана каада-салтын баяндаган ар кыл авторлордун кызыктуу
эмгектери топтолгон.
Бул китеп да ошол салтты улантып, кыргыздардын тарыхы, рухий дүйнөсү
жөнүндөгү маалыматтар, изилдөөлөр жана жаңы табылгалар менен толукталды.
ББК 63.3 (2 Ки)
ISBN 5-7499-0033-9
©«Кыргызстан — Сорос» фонду

1

www.bizdin.kg

ОКУРМАНГА
